[NoCoverage] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:41:38
             .leftJoinAndSelect('curso.lecciones', 'leccion')
             .leftJoinAndSelect('curso.etiquetas', 'etiqueta')
             .leftJoinAndSelect('curso.instructor', 'instructor')
-            .where('curso.id = :id', { id })
+            .where('curso.id = :id', {})
             .getOne();
     }

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:50:13
         const { detalle, lecciones, etiquetaIds, instructorId, ...cursoData } = dto;
 
         let etiquetas: Etiqueta[] = [];
-        if (etiquetaIds?.length) {
+        if (false) {
             etiquetas = await this.etiquetaRepository.find({ where: { id: In(etiquetaIds) } });
         }
killedBy: CursoCompletoService - Pruebas de Integración Flujo completo de creación de curso debe crear un curso con todas sus relaciones correctamente
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:50:34
         const { detalle, lecciones, etiquetaIds, instructorId, ...cursoData } = dto;
 
         let etiquetas: Etiqueta[] = [];
-        if (etiquetaIds?.length) {
-            etiquetas = await this.etiquetaRepository.find({ where: { id: In(etiquetaIds) } });
-        }
+        if (etiquetaIds?.length) {}
 
         let instructor: Instructor | null = null;
killedBy: CursoCompletoService - Pruebas de Integración Flujo completo de creación de curso debe crear un curso con todas sus relaciones correctamente
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:55:27
         }
 
         let instructor: Instructor | null = null;
-        if (instructorId) {
-            instructor = await this.instructorRepository.findOne({ where: { id: instructorId } }) as Instructor | null;
-        }
+        if (instructorId) {}
 
         const curso = this.cursoRepository.create({
killedBy: CursoCompletoService - Pruebas de Integración Flujo completo de creación de curso debe crear un curso con todas sus relaciones correctamente
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:55:13
         }
 
         let instructor: Instructor | null = null;
-        if (instructorId) {
+        if (false) {
             instructor = await this.instructorRepository.findOne({ where: { id: instructorId } }) as Instructor | null;
         }
killedBy: CursoCompletoService - Pruebas de Integración Flujo completo de creación de curso debe crear un curso con todas sus relaciones correctamente
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] LogicalOperator
modules/curso-completo/services/curso-completo.service.ts:64:25
             detalle: detalle as DetalleCurso,
             lecciones: (lecciones || []) as LeccionCompleta[],
             etiquetas,
-            instructor: instructor || undefined
+            instructor: instructor && undefined
         });
 
killedBy: CursoCompletoService - Pruebas de Integración Flujo completo de creación de curso debe crear un curso con todas sus relaciones correctamente
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] MethodExpression
modules/curso-completo/services/curso-completo.service.ts:71:24
     }
 
     async crearEtiqueta(dto: CreateEtiquetaDto): Promise<Etiqueta> {
-        const nombre = dto.nombre.trim().toLowerCase();
+        const nombre = dto.nombre.toLowerCase();
         const existente = await this.etiquetaRepository.findOne({ where: { nombre } });
 
killedBy: CursoCompletoService - Pruebas Unitarias crearEtiqueta - Caso de uso básico debe normalizar nombre de etiqueta a minúsculas
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "where": Object {
-     "nombre": "react hooks",

[Killed] MethodExpression
modules/curso-completo/services/curso-completo.service.ts:71:24
     }
 
     async crearEtiqueta(dto: CreateEtiquetaDto): Promise<Etiqueta> {
-        const nombre = dto.nombre.trim().toLowerCase();
+        const nombre = dto.nombre.trim().toUpperCase();
         const existente = await this.etiquetaRepository.findOne({ where: { nombre } });
 
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe crear etiquetas, instructor y curso con persistencia real
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "javascript avanzado"
Received: "JAVASCRIPT AVANZADO"

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:72:65
 
     async crearEtiqueta(dto: CreateEtiquetaDto): Promise<Etiqueta> {
         const nombre = dto.nombre.trim().toLowerCase();
-        const existente = await this.etiquetaRepository.findOne({ where: { nombre } });
+        const existente = await this.etiquetaRepository.findOne({});
 
         if (existente) {
killedBy: CursoCompletoService - Pruebas Unitarias crearEtiqueta - Caso de uso básico debe crear etiqueta exitosamente con nombre válido
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "nombre": "javascript",

[Killed] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:74:24
         const nombre = dto.nombre.trim().toLowerCase();
         const existente = await this.etiquetaRepository.findOne({ where: { nombre } });
 
-        if (existente) {
-            throw new BadRequestException(`La etiqueta '${dto.nombre}' ya existe`);
-        }
+        if (existente) {}
 
         const etiqueta = this.etiquetaRepository.create({ nombre });
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar errores de duplicación correctamente
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "La etiqueta 'REACT HOOKS' ya existe"
Received message:   "duplicate key value violates unique constraint \"UQ_a4b4a8a74f3d0795a06ef1f24b8\""

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:78:57
             throw new BadRequestException(`La etiqueta '${dto.nombre}' ya existe`);
         }
 
-        const etiqueta = this.etiquetaRepository.create({ nombre });
+        const etiqueta = this.etiquetaRepository.create({});
 
         return this.etiquetaRepository.save(etiqueta);
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe crear etiquetas, instructor y curso con persistencia real
statusReason: QueryFailedError: null value in column "nombre" of relation "etiquetas" violates not-null constraint

[Killed] MethodExpression
modules/curso-completo/services/curso-completo.service.ts:84:27
     }
 
     async crearInstructor(dto: CreateInstructorDto): Promise<Instructor> {
-        const emailNorm = dto.email.trim().toLowerCase();
+        const emailNorm = dto.email.trim().toUpperCase();
         const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
 
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe crear etiquetas, instructor y curso con persistencia real
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "maria.gonzalez@test.com"
Received: "MARIA.GONZALEZ@TEST.COM"

[Survived] MethodExpression
modules/curso-completo/services/curso-completo.service.ts:84:27
     }
 
     async crearInstructor(dto: CreateInstructorDto): Promise<Instructor> {
-        const emailNorm = dto.email.trim().toLowerCase();
+        const emailNorm = dto.email.toLowerCase();
         const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
 

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:85:67
 
     async crearInstructor(dto: CreateInstructorDto): Promise<Instructor> {
         const emailNorm = dto.email.trim().toLowerCase();
-        const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
+        const existente = await this.instructorRepository.findOne({});
 
         if (existente) {
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe crear etiquetas, instructor y curso con persistencia real
statusReason: Error: You must provide selection conditions in order to find a single row.

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:85:76
 
     async crearInstructor(dto: CreateInstructorDto): Promise<Instructor> {
         const emailNorm = dto.email.trim().toLowerCase();
-        const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
+        const existente = await this.instructorRepository.findOne({ where: {} });
 
         if (existente) {
killedBy: CursoCompletoService - Pruebas Unitarias crearInstructor - Validación de duplicados debe crear instructor exitosamente
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "email": "juan.perez@example.com",

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:87:13
         const emailNorm = dto.email.trim().toLowerCase();
         const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
 
-        if (existente) {
+        if (true) {
             throw new BadRequestException(`Ya existe un instructor con email ${dto.email}`);
         }
killedBy: CursoCompletoService - Pruebas Unitarias crearInstructor - Validación de duplicados debe crear instructor exitosamente
statusReason: BadRequestException: Ya existe un instructor con email Juan.Perez@Example.com

[Killed] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:87:24
         const emailNorm = dto.email.trim().toLowerCase();
         const existente = await this.instructorRepository.findOne({ where: { email: emailNorm } });
 
-        if (existente) {
-            throw new BadRequestException(`Ya existe un instructor con email ${dto.email}`);
-        }
+        if (existente) {}
 
         const instructor = this.instructorRepository.create({ nombre: dto.nombre.trim(), email: emailNorm });
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar errores de duplicación correctamente
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"createdAt": 2025-09-02T22:41:25.360Z, "deletedAt": null, "email": "pedro@test.com", "id": "e232a46c-321d-4ade-ab53-a22fc793449d", "nombre": "Pedro Diferente", "updatedAt": 2025-09-02T22:41:25.360Z}

[Survived] MethodExpression
modules/curso-completo/services/curso-completo.service.ts:91:71
             throw new BadRequestException(`Ya existe un instructor con email ${dto.email}`);
         }
 
-        const instructor = this.instructorRepository.create({ nombre: dto.nombre.trim(), email: emailNorm });
+        const instructor = this.instructorRepository.create({ nombre: dto.nombre, email: emailNorm });
 
         return this.instructorRepository.save(instructor);

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:112:67
     }
 
     async crearEvaluacion(cursoId: string, dto: CreateEvaluacionDto): Promise<Evaluacion> {
-        const curso = await this.cursoRepository.findOne({ where: { id: cursoId } });
+        const curso = await this.cursoRepository.findOne({ where: {} });
 
         if (!curso) {
killedBy: CursoCompletoService - Pruebas Unitarias crearEvaluacion - Flujo crítico debe crear evaluación para curso existente
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "curso-123",

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:114:13
     async crearEvaluacion(cursoId: string, dto: CreateEvaluacionDto): Promise<Evaluacion> {
         const curso = await this.cursoRepository.findOne({ where: { id: cursoId } });
 
-        if (!curso) {
+        if (true) {
             throw new BadRequestException(`Curso con id ${cursoId} no existe`);
         }
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe validar curso inexistente para evaluaciones
statusReason: BadRequestException: Curso con id 2bb66c2e-d16e-4bde-a071-e3ee7032fde3 no existe

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:114:13
     async crearEvaluacion(cursoId: string, dto: CreateEvaluacionDto): Promise<Evaluacion> {
         const curso = await this.cursoRepository.findOne({ where: { id: cursoId } });
 
-        if (!curso) {
+        if (false) {
             throw new BadRequestException(`Curso con id ${cursoId} no existe`);
         }
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe validar curso inexistente para evaluaciones
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"comentario": "No debería crearse", "createdAt": 2025-09-02T22:42:22.251Z, "curso": null, "deletedAt": null, "id": "f1d57588-b6ee-454c-bb62-e13cbc36e1de", "puntuacion": 5, "updatedAt": 2025-09-02T22:42:22.251Z}

[Killed] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:118:61
             throw new BadRequestException(`Curso con id ${cursoId} no existe`);
         }
 
-        const evaluacion = this.evaluacionRepository.create({
-            curso: curso,
-            puntuacion: dto.puntuacion,
-            comentario: dto.comentario,
-        });
+        const evaluacion = this.evaluacionRepository.create({});
 
         return this.evaluacionRepository.save(evaluacion);
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe validar curso inexistente para evaluaciones
statusReason: QueryFailedError: null value in column "puntuacion" of relation "evaluaciones" violates not-null constraint

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:136:13
 
         const resultadoCache: CursoCompleto[] | undefined = await this.cacheManager.get(cacheKey);
 
-        if (resultadoCache) {
+        if (true) {
             return resultadoCache;
         }
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar búsqueda avanzada con repositorios reales
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:136:13
 
         const resultadoCache: CursoCompleto[] | undefined = await this.cacheManager.get(cacheKey);
 
-        if (resultadoCache) {
+        if (false) {
             return resultadoCache;
         }
killedBy: CursoCompletoService - Pruebas Unitarias busquedaAvanzadaOptimizada - Caching y query building debe retornar resultados desde cache cuando están disponibles
statusReason: TypeError: Cannot read properties of undefined (reading 'leftJoinAndSelect')

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:161:13
                 'curso.deleted_at',
             ]);
 
-        if (params.description) {
+        if (true) {
             query = query.andWhere('curso.descripcion ILIKE :description', { description: `%${params.description}%` });
         }
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar búsqueda avanzada con repositorios reales
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[NoCoverage] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:161:33
                 'curso.deleted_at',
             ]);
 
-        if (params.description) {
-            query = query.andWhere('curso.descripcion ILIKE :description', { description: `%${params.description}%` });
-        }
+        if (params.description) {}
 
         if (params.textoBusqueda) {

[NoCoverage] ObjectLiteral
modules/curso-completo/services/curso-completo.service.ts:162:76
             ]);
 
         if (params.description) {
-            query = query.andWhere('curso.descripcion ILIKE :description', { description: `%${params.description}%` });
+            query = query.andWhere('curso.descripcion ILIKE :description', {});
         }
 

[Killed] BlockStatement
modules/curso-completo/services/curso-completo.service.ts:165:35
             query = query.andWhere('curso.descripcion ILIKE :description', { description: `%${params.description}%` });
         }
 
-        if (params.textoBusqueda) {
-            query = query.andWhere(
-                "to_tsvector('spanish', curso.titulo || ' ' || curso.descripcion) @@ plainto_tsquery('spanish', :texto)",
-                { texto: params.textoBusqueda }
-            );
-        }
+        if (params.textoBusqueda) {}
 
         query = query
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar búsqueda avanzada con repositorios reales
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] ConditionalExpression
modules/curso-completo/services/curso-completo.service.ts:165:13
             query = query.andWhere('curso.descripcion ILIKE :description', { description: `%${params.description}%` });
         }
 
-        if (params.textoBusqueda) {
+        if (false) {
             query = query.andWhere(
                 "to_tsvector('spanish', curso.titulo || ' ' || curso.descripcion) @@ plainto_tsquery('spanish', :texto)",
killedBy: Sistema Gestión Cursos - Integración con Test Containers Flujo completo de gestión de cursos - Infraestructura real debe manejar búsqueda avanzada con repositorios reales
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2

[Killed] LogicalOperator
modules/curso-completo/services/curso-completo.service.ts:175:20
         query = query
             .orderBy('curso.created_at', 'DESC')
             .addOrderBy('curso.titulo', 'ASC')
-            .limit(params.limit || DEFAULT_CURSO_COMPLETO_SEARCH_LIMIT)
+            .limit(params.limit && DEFAULT_CURSO_COMPLETO_SEARCH_LIMIT)
             .offset(params.offset || DEFAULT_CURSO_COMPLETO_SEARCH_OFFSET);
 
killedBy: CursoCompletoService - Pruebas Unitarias busquedaAvanzadaOptimizada - Caching y query building debe ejecutar query y cachear resultados cuando cache está vacío
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 5
Received: 20

Number of calls: 1

[Survived] LogicalOperator
modules/curso-completo/services/curso-completo.service.ts:176:21
             .orderBy('curso.created_at', 'DESC')
             .addOrderBy('curso.titulo', 'ASC')
             .limit(params.limit || DEFAULT_CURSO_COMPLETO_SEARCH_LIMIT)
-            .offset(params.offset || DEFAULT_CURSO_COMPLETO_SEARCH_OFFSET);
+            .offset(params.offset && DEFAULT_CURSO_COMPLETO_SEARCH_OFFSET);
 
         const resultados = await query.getMany();
